Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_ls60_rd/pic32cm_ls60_rd_smart_lock/firmware/NonSecure/firmware/src/packs/PIC32CM5164LS60064_DFP/pio/pic32cm5164ls60064.h
#define PIN_PB09F_PTC_DRV21                        _UINT32_(41)
#define MUX_PB09F_PTC_DRV21                        _UINT32_(5) 
#define PINMUX_PB09F_PTC_DRV21                     ((PIN_PB09F_PTC_DRV21 << 16) | MUX_PB09F_PTC_DRV21)
#define PORT_PB09F_PTC_DRV21                       (_UINT32_(1) << 9)

#define PIN_PA20F_PTC_DRV22                        _UINT32_(20)
#define MUX_PA20F_PTC_DRV22                        _UINT32_(5) 
#define PINMUX_PA20F_PTC_DRV22                     ((PIN_PA20F_PTC_DRV22 << 16) | MUX_PA20F_PTC_DRV22)
#define PORT_PA20F_PTC_DRV22                       (_UINT32_(1) << 20)

#define PIN_PA21F_PTC_DRV23                        _UINT32_(21)
#define MUX_PA21F_PTC_DRV23                        _UINT32_(5) 
#define PINMUX_PA21F_PTC_DRV23                     ((PIN_PA21F_PTC_DRV23 << 16) | MUX_PA21F_PTC_DRV23)
#define PORT_PA21F_PTC_DRV23                       (_UINT32_(1) << 21)

#define PIN_PA12F_PTC_DRV24                        _UINT32_(12)
#define MUX_PA12F_PTC_DRV24                        _UINT32_(5) 
#define PINMUX_PA12F_PTC_DRV24                     ((PIN_PA12F_PTC_DRV24 << 16) | MUX_PA12F_PTC_DRV24)
#define PORT_PA12F_PTC_DRV24                       (_UINT32_(1) << 12)

#define PIN_PA13F_PTC_DRV25                        _UINT32_(13)
#define MUX_PA13F_PTC_DRV25                        _UINT32_(5) 
#define PINMUX_PA13F_PTC_DRV25                     ((PIN_PA13F_PTC_DRV25 << 16) | MUX_PA13F_PTC_DRV25)
#define PORT_PA13F_PTC_DRV25                       (_UINT32_(1) << 13)

#define PIN_PB04F_PTC_DRV26                        _UINT32_(36)
#define MUX_PB04F_PTC_DRV26                        _UINT32_(5) 
#define PINMUX_PB04F_PTC_DRV26                     ((PIN_PB04F_PTC_DRV26 << 16) | MUX_PB04F_PTC_DRV26)
#define PORT_PB04F_PTC_DRV26                       (_UINT32_(1) << 4)

#define PIN_PB05F_PTC_DRV27                        _UINT32_(37)
#define MUX_PB05F_PTC_DRV27                        _UINT32_(5) 
#define PINMUX_PB05F_PTC_DRV27                     ((PIN_PB05F_PTC_DRV27 << 16) | MUX_PB05F_PTC_DRV27)
#define PORT_PB05F_PTC_DRV27                       (_UINT32_(1) << 5)

#define PIN_PB06F_PTC_DRV28                        _UINT32_(38)
#define MUX_PB06F_PTC_DRV28                        _UINT32_(5) 
#define PINMUX_PB06F_PTC_DRV28                     ((PIN_PB06F_PTC_DRV28 << 16) | MUX_PB06F_PTC_DRV28)
#define PORT_PB06F_PTC_DRV28                       (_UINT32_(1) << 6)

#define PIN_PB07F_PTC_DRV29                        _UINT32_(39)
#define MUX_PB07F_PTC_DRV29                        _UINT32_(5) 
#define PINMUX_PB07F_PTC_DRV29                     ((PIN_PB07F_PTC_DRV29 << 16) | MUX_PB07F_PTC_DRV29)
#define PORT_PB07F_PTC_DRV29                       (_UINT32_(1) << 7)

#define PIN_PB12F_PTC_DRV30                        _UINT32_(44)
#define MUX_PB12F_PTC_DRV30                        _UINT32_(5) 
#define PINMUX_PB12F_PTC_DRV30                     ((PIN_PB12F_PTC_DRV30 << 16) | MUX_PB12F_PTC_DRV30)
#define PORT_PB12F_PTC_DRV30                       (_UINT32_(1) << 12)

#define PIN_PB13F_PTC_DRV31                        _UINT32_(45)
#define MUX_PB13F_PTC_DRV31                        _UINT32_(5) 
#define PINMUX_PB13F_PTC_DRV31                     ((PIN_PB13F_PTC_DRV31 << 16) | MUX_PB13F_PTC_DRV31)
#define PORT_PB13F_PTC_DRV31                       (_UINT32_(1) << 13)

#define PIN_PA03B_PTC_ECI0                         _UINT32_(3) 
#define MUX_PA03B_PTC_ECI0                         _UINT32_(1) 
#define PINMUX_PA03B_PTC_ECI0                      ((PIN_PA03B_PTC_ECI0 << 16) | MUX_PA03B_PTC_ECI0)
#define PORT_PA03B_PTC_ECI0                        (_UINT32_(1) << 3)

#define PIN_PA04B_PTC_ECI1                         _UINT32_(4) 
#define MUX_PA04B_PTC_ECI1                         _UINT32_(1) 
#define PINMUX_PA04B_PTC_ECI1                      ((PIN_PA04B_PTC_ECI1 << 16) | MUX_PA04B_PTC_ECI1)
#define PORT_PA04B_PTC_ECI1                        (_UINT32_(1) << 4)

#define PIN_PA05B_PTC_ECI2                         _UINT32_(5) 
#define MUX_PA05B_PTC_ECI2                         _UINT32_(1) 
#define PINMUX_PA05B_PTC_ECI2                      ((PIN_PA05B_PTC_ECI2 << 16) | MUX_PA05B_PTC_ECI2)
#define PORT_PA05B_PTC_ECI2                        (_UINT32_(1) << 5)

#define PIN_PA06B_PTC_ECI3                         _UINT32_(6) 
#define MUX_PA06B_PTC_ECI3                         _UINT32_(1) 
#define PINMUX_PA06B_PTC_ECI3                      ((PIN_PA06B_PTC_ECI3 << 16) | MUX_PA06B_PTC_ECI3)
#define PORT_PA06B_PTC_ECI3                        (_UINT32_(1) << 6)

#define PIN_PA00B_PTC_X0                           _UINT32_(0) 
#define MUX_PA00B_PTC_X0                           _UINT32_(1) 
#define PINMUX_PA00B_PTC_X0                        ((PIN_PA00B_PTC_X0 << 16) | MUX_PA00B_PTC_X0)
#define PORT_PA00B_PTC_X0                          (_UINT32_(1) << 0)

#define PIN_PA01B_PTC_X1                           _UINT32_(1) 
#define MUX_PA01B_PTC_X1                           _UINT32_(1) 
#define PINMUX_PA01B_PTC_X1                        ((PIN_PA01B_PTC_X1 << 16) | MUX_PA01B_PTC_X1)
#define PORT_PA01B_PTC_X1                          (_UINT32_(1) << 1)

#define PIN_PA02B_PTC_X2                           _UINT32_(2) 
#define MUX_PA02B_PTC_X2                           _UINT32_(1) 
#define PINMUX_PA02B_PTC_X2                        ((PIN_PA02B_PTC_X2 << 16) | MUX_PA02B_PTC_X2)
#define PORT_PA02B_PTC_X2                          (_UINT32_(1) << 2)

#define PIN_PA03B_PTC_X3                           _UINT32_(3) 
#define MUX_PA03B_PTC_X3                           _UINT32_(1) 
#define PINMUX_PA03B_PTC_X3                        ((PIN_PA03B_PTC_X3 << 16) | MUX_PA03B_PTC_X3)
#define PORT_PA03B_PTC_X3                          (_UINT32_(1) << 3)

#define PIN_PA05B_PTC_X4                           _UINT32_(5) 
#define MUX_PA05B_PTC_X4                           _UINT32_(1) 
#define PINMUX_PA05B_PTC_X4                        ((PIN_PA05B_PTC_X4 << 16) | MUX_PA05B_PTC_X4)
#define PORT_PA05B_PTC_X4                          (_UINT32_(1) << 5)

