Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_ls60_rd/pic32cm_ls60_rd_smart_lock/firmware/NonSecure/firmware/src/packs/PIC32CM5164LS60064_DFP/pio/pic32cm5164ls60064.h
#define PIN_PB04B_PTC_Y26                          _UINT32_(36)
#define MUX_PB04B_PTC_Y26                          _UINT32_(1) 
#define PINMUX_PB04B_PTC_Y26                       ((PIN_PB04B_PTC_Y26 << 16) | MUX_PB04B_PTC_Y26)
#define PORT_PB04B_PTC_Y26                         (_UINT32_(1) << 4)

#define PIN_PB05B_PTC_Y27                          _UINT32_(37)
#define MUX_PB05B_PTC_Y27                          _UINT32_(1) 
#define PINMUX_PB05B_PTC_Y27                       ((PIN_PB05B_PTC_Y27 << 16) | MUX_PB05B_PTC_Y27)
#define PORT_PB05B_PTC_Y27                         (_UINT32_(1) << 5)

#define PIN_PB06B_PTC_Y28                          _UINT32_(38)
#define MUX_PB06B_PTC_Y28                          _UINT32_(1) 
#define PINMUX_PB06B_PTC_Y28                       ((PIN_PB06B_PTC_Y28 << 16) | MUX_PB06B_PTC_Y28)
#define PORT_PB06B_PTC_Y28                         (_UINT32_(1) << 6)

#define PIN_PB07B_PTC_Y29                          _UINT32_(39)
#define MUX_PB07B_PTC_Y29                          _UINT32_(1) 
#define PINMUX_PB07B_PTC_Y29                       ((PIN_PB07B_PTC_Y29 << 16) | MUX_PB07B_PTC_Y29)
#define PORT_PB07B_PTC_Y29                         (_UINT32_(1) << 7)

#define PIN_PB12B_PTC_Y30                          _UINT32_(44)
#define MUX_PB12B_PTC_Y30                          _UINT32_(1) 
#define PINMUX_PB12B_PTC_Y30                       ((PIN_PB12B_PTC_Y30 << 16) | MUX_PB12B_PTC_Y30)
#define PORT_PB12B_PTC_Y30                         (_UINT32_(1) << 12)

#define PIN_PB13B_PTC_Y31                          _UINT32_(45)
#define MUX_PB13B_PTC_Y31                          _UINT32_(1) 
#define PINMUX_PB13B_PTC_Y31                       ((PIN_PB13B_PTC_Y31 << 16) | MUX_PB13B_PTC_Y31)
#define PORT_PB13B_PTC_Y31                         (_UINT32_(1) << 13)

/* ========== PORT definition for RTC peripheral ========== */
#define PIN_PA08G_RTC_IN0                          _UINT32_(8) 
#define MUX_PA08G_RTC_IN0                          _UINT32_(6) 
#define PINMUX_PA08G_RTC_IN0                       ((PIN_PA08G_RTC_IN0 << 16) | MUX_PA08G_RTC_IN0)
#define PORT_PA08G_RTC_IN0                         (_UINT32_(1) << 8)

#define PIN_PA09G_RTC_IN1                          _UINT32_(9) 
#define MUX_PA09G_RTC_IN1                          _UINT32_(6) 
#define PINMUX_PA09G_RTC_IN1                       ((PIN_PA09G_RTC_IN1 << 16) | MUX_PA09G_RTC_IN1)
#define PORT_PA09G_RTC_IN1                         (_UINT32_(1) << 9)

#define PIN_PA16G_RTC_IN2                          _UINT32_(16)
#define MUX_PA16G_RTC_IN2                          _UINT32_(6) 
#define PINMUX_PA16G_RTC_IN2                       ((PIN_PA16G_RTC_IN2 << 16) | MUX_PA16G_RTC_IN2)
#define PORT_PA16G_RTC_IN2                         (_UINT32_(1) << 16)

#define PIN_PA17G_RTC_IN3                          _UINT32_(17)
#define MUX_PA17G_RTC_IN3                          _UINT32_(6) 
#define PINMUX_PA17G_RTC_IN3                       ((PIN_PA17G_RTC_IN3 << 16) | MUX_PA17G_RTC_IN3)
#define PORT_PA17G_RTC_IN3                         (_UINT32_(1) << 17)

#define PIN_PB14G_RTC_IN4                          _UINT32_(46)
#define MUX_PB14G_RTC_IN4                          _UINT32_(6) 
#define PINMUX_PB14G_RTC_IN4                       ((PIN_PB14G_RTC_IN4 << 16) | MUX_PB14G_RTC_IN4)
#define PORT_PB14G_RTC_IN4                         (_UINT32_(1) << 14)

#define PIN_PB15G_RTC_IN5                          _UINT32_(47)
#define MUX_PB15G_RTC_IN5                          _UINT32_(6) 
#define PINMUX_PB15G_RTC_IN5                       ((PIN_PB15G_RTC_IN5 << 16) | MUX_PB15G_RTC_IN5)
#define PORT_PB15G_RTC_IN5                         (_UINT32_(1) << 15)

#define PIN_PA18G_RTC_OUT0                         _UINT32_(18)
#define MUX_PA18G_RTC_OUT0                         _UINT32_(6) 
#define PINMUX_PA18G_RTC_OUT0                      ((PIN_PA18G_RTC_OUT0 << 16) | MUX_PA18G_RTC_OUT0)
#define PORT_PA18G_RTC_OUT0                        (_UINT32_(1) << 18)

#define PIN_PA19G_RTC_OUT1                         _UINT32_(19)
#define MUX_PA19G_RTC_OUT1                         _UINT32_(6) 
#define PINMUX_PA19G_RTC_OUT1                      ((PIN_PA19G_RTC_OUT1 << 16) | MUX_PA19G_RTC_OUT1)
#define PORT_PA19G_RTC_OUT1                        (_UINT32_(1) << 19)

#define PIN_PA22G_RTC_OUT2                         _UINT32_(22)
#define MUX_PA22G_RTC_OUT2                         _UINT32_(6) 
#define PINMUX_PA22G_RTC_OUT2                      ((PIN_PA22G_RTC_OUT2 << 16) | MUX_PA22G_RTC_OUT2)
#define PORT_PA22G_RTC_OUT2                        (_UINT32_(1) << 22)

#define PIN_PA23G_RTC_OUT3                         _UINT32_(23)
#define MUX_PA23G_RTC_OUT3                         _UINT32_(6) 
#define PINMUX_PA23G_RTC_OUT3                      ((PIN_PA23G_RTC_OUT3 << 16) | MUX_PA23G_RTC_OUT3)
#define PORT_PA23G_RTC_OUT3                        (_UINT32_(1) << 23)

#define PIN_PB16G_RTC_OUT4                         _UINT32_(48)
#define MUX_PB16G_RTC_OUT4                         _UINT32_(6) 
#define PINMUX_PB16G_RTC_OUT4                      ((PIN_PB16G_RTC_OUT4 << 16) | MUX_PB16G_RTC_OUT4)
#define PORT_PB16G_RTC_OUT4                        (_UINT32_(1) << 16)

#define PIN_PB17G_RTC_OUT5                         _UINT32_(49)
#define MUX_PB17G_RTC_OUT5                         _UINT32_(6) 
#define PINMUX_PB17G_RTC_OUT5                      ((PIN_PB17G_RTC_OUT5 << 16) | MUX_PB17G_RTC_OUT5)
#define PORT_PB17G_RTC_OUT5                        (_UINT32_(1) << 17)

/* ========== PORT definition for SERCOM0 peripheral ========== */
#define PIN_PA04D_SERCOM0_PAD0                     _UINT32_(4) 
#define MUX_PA04D_SERCOM0_PAD0                     _UINT32_(3) 
#define PINMUX_PA04D_SERCOM0_PAD0                  ((PIN_PA04D_SERCOM0_PAD0 << 16) | MUX_PA04D_SERCOM0_PAD0)
#define PORT_PA04D_SERCOM0_PAD0                    (_UINT32_(1) << 4)

#define PIN_PA16D_SERCOM0_PAD0                     _UINT32_(16)
#define MUX_PA16D_SERCOM0_PAD0                     _UINT32_(3) 
#define PINMUX_PA16D_SERCOM0_PAD0                  ((PIN_PA16D_SERCOM0_PAD0 << 16) | MUX_PA16D_SERCOM0_PAD0)
#define PORT_PA16D_SERCOM0_PAD0                    (_UINT32_(1) << 16)

#define PIN_PA22C_SERCOM0_PAD0                     _UINT32_(22)
#define MUX_PA22C_SERCOM0_PAD0                     _UINT32_(2) 
#define PINMUX_PA22C_SERCOM0_PAD0                  ((PIN_PA22C_SERCOM0_PAD0 << 16) | MUX_PA22C_SERCOM0_PAD0)
#define PORT_PA22C_SERCOM0_PAD0                    (_UINT32_(1) << 22)

#define PIN_PA05D_SERCOM0_PAD1                     _UINT32_(5) 
#define MUX_PA05D_SERCOM0_PAD1                     _UINT32_(3) 
#define PINMUX_PA05D_SERCOM0_PAD1                  ((PIN_PA05D_SERCOM0_PAD1 << 16) | MUX_PA05D_SERCOM0_PAD1)
#define PORT_PA05D_SERCOM0_PAD1                    (_UINT32_(1) << 5)

#define PIN_PA17D_SERCOM0_PAD1                     _UINT32_(17)
#define MUX_PA17D_SERCOM0_PAD1                     _UINT32_(3) 
#define PINMUX_PA17D_SERCOM0_PAD1                  ((PIN_PA17D_SERCOM0_PAD1 << 16) | MUX_PA17D_SERCOM0_PAD1)
#define PORT_PA17D_SERCOM0_PAD1                    (_UINT32_(1) << 17)

#define PIN_PA23C_SERCOM0_PAD1                     _UINT32_(23)
#define MUX_PA23C_SERCOM0_PAD1                     _UINT32_(2) 
#define PINMUX_PA23C_SERCOM0_PAD1                  ((PIN_PA23C_SERCOM0_PAD1 << 16) | MUX_PA23C_SERCOM0_PAD1)
#define PORT_PA23C_SERCOM0_PAD1                    (_UINT32_(1) << 23)

#define PIN_PA06D_SERCOM0_PAD2                     _UINT32_(6) 
#define MUX_PA06D_SERCOM0_PAD2                     _UINT32_(3) 
#define PINMUX_PA06D_SERCOM0_PAD2                  ((PIN_PA06D_SERCOM0_PAD2 << 16) | MUX_PA06D_SERCOM0_PAD2)
#define PORT_PA06D_SERCOM0_PAD2                    (_UINT32_(1) << 6)

#define PIN_PA14D_SERCOM0_PAD2                     _UINT32_(14)
#define MUX_PA14D_SERCOM0_PAD2                     _UINT32_(3) 
#define PINMUX_PA14D_SERCOM0_PAD2                  ((PIN_PA14D_SERCOM0_PAD2 << 16) | MUX_PA14D_SERCOM0_PAD2)
#define PORT_PA14D_SERCOM0_PAD2                    (_UINT32_(1) << 14)

#define PIN_PA18D_SERCOM0_PAD2                     _UINT32_(18)
#define MUX_PA18D_SERCOM0_PAD2                     _UINT32_(3) 
#define PINMUX_PA18D_SERCOM0_PAD2                  ((PIN_PA18D_SERCOM0_PAD2 << 16) | MUX_PA18D_SERCOM0_PAD2)
#define PORT_PA18D_SERCOM0_PAD2                    (_UINT32_(1) << 18)

